"""
质数:只能被1和自身整除的数字
最外圈循环代表待比较的每位数字,
内层循环代表1与自身中间需要比较的数字
"""
for n in range(2, 10):
    for x in range(2, n):
        if n % x == 0:
            print(n, '等于', x, '*', n//x)
            break
    else:
        # 循环中没有找到元素
        print(n, ' 是质数')
"""
enumerate内置函数===========================================================
"""
sequence = [12, 34, 34, 23, 45, 76, 89]
for i, j in enumerate(sequence):
    print(i, j)
"""
99乘法表(1)===========================================================
"""
for i in range(1, 10):
    for j in range(1, i + 1):
        mul = i * j
        print("%d * %d = %d" % (j, i, mul), end="  ")
    else:
        print()
"""
99乘法表(2)===========================================================
"""
# 外边一层循环控制行数
# i是行数
i = 1
while i <= 9:
     # 里面一层循环控制每一行中的列数
     j=1
     while j <= i:
          mut = j * i
          print("%d*%d=%d" % (j, i, mut), end="  ")
          j += 1
     print("")
     i += 1